emacs-cheat-sheet.org
* Jeffs Frequently Used Bindings
** Recent bindings to get used to

   | key       | description                                 |
   |-----------+---------------------------------------------|
   | C-.       | avy character timer; jump to 3-char pattern |
   | C-c C-r   | crux rename file and buffer                 |
   | C-c & C-s | choose a snippet to insert                  |
   | s-x       | create an auto-snippet                      |
   | s-y       | expand auto-snippet                         |

** Global bindings

   | key         | description                                              |
   |-------------+----------------------------------------------------------|
   | C-c C-s     | schedule a task on a date                                |
   | C-c l       | store a link, like in a file; region becomes search text |
   | C-c C-l     | create or edit an org mode link                          |
   | C-c C-x C-s | archive a subtree                                        |

** Projectile bindings

   bbatsov's [[https://github.com/bbatsov/projectile/blob/master/doc/usage.md#interactive-commands][key bindings table]]

   | key       | description             |
   |-----------+-------------------------|
   | C-c p f   | list files in project   |
   | C-c p s s | grep project for string |
   | C-c p k   | kill project buffers    |

** Org mode bindings

   | key         | description                                  |
   |-------------+----------------------------------------------|
   | C-c %       | Push the current position onto the mark ring |
   | C-c C-v d   | demarcate a block (select region first)      |
   | C-c C-x C-s | move subtree to archive file                 |

** Register, Bookmark & Mark bindings

   | key binding | description                                  |
   |-------------+----------------------------------------------|
   | C-x r l     | list available bookmarks                     |
   | C-x r m     | set a bookmark                               |
   | C-x r b     | jump to a bookmark                           |
   |-------------+----------------------------------------------|
   | C-x r s     | store region in register                     |
   | C-x r i     | insert contents of register                  |
   | C-x r SPC   | store point in register                      |
   | C-x r j     | jump to register                             |
   |-------------+----------------------------------------------|
   | C-SPC       | set the mark                                 |
   | C-u C-SPC   | jump to mark; repeat to go back in mark ring |

** Agenda view bindings

   | key    | description                    |
   |--------+--------------------------------|
   | t      | move a task through its states |
   | z      | add a note to a task           |
   | a or $ | archive done tasks             |

* Dired
** Key bindings

   | key          | usage                             |
   |--------------+-----------------------------------|
   | C-0 w or 0 w | dired copy full path to clipboard |

* Narrow
** Narrow Common Key Bindings

   | key     | usage                                     |
   |---------+-------------------------------------------|
   | C-x n n | narrow down to between point and mark     |
   | C-x n w | widen to make entire buffer visible again |
   | C-x n p | narrow to current page                    |
   | C-x n d | narrow-to-defun                           |

* Rectangles

  | key                                          | usage                                                                                                     |
  |----------------------------------------------+-----------------------------------------------------------------------------------------------------------|
  | C-x r k                                      | kill the text of the region-rectangle, saving its contents as the last killed rectangle                   |
  | C-x r M-w                                    | Save the text of the region-rectangle as the last killed rectangle                                        |
  | C-x r d                                      | Delete the text of the region-rectangle                                                                   |
  | C-x r y                                      | Yank the last killed rectangle with its upper left corner at point                                        |
  | C-x r o                                      | Insert blank space to fill the space of the region-rectangle.  Pushes the previous contents to the right. |
  | C-x r N                                      | Insert line numbers along the left edge of the region rectangle.  Pushes content right                    |
  | C-x r c                                      | Clear region-rectangle by replacing its contents with spaces.                                             |
  | M-x delete-whitespace-rectangle              | Delete whitespace in each of the lines of the rectangle, starting from the left edge column of the rect   |
  | C-x r t _string_ RET                         | Replace rectangle contents with _string_ on each line                                                     |
  | M-x string-insert-rectangle RET _string_ RET | Insert _string_ on each line of rectangle.                                                                |
  | C-x SPC                                      | Toggle Rectangle Mark mode.                                                                               |

