emacs-cheat-sheet.org
*** Row and Column Editing

    | key          | good for                                               |
    |--------------+--------------------------------------------------------|
    | M-LEFT/RIGHT | move the column left/right                             |
    | M-S-LEFT     | kill the current column                                |
    | M-S-RIGHT    | insert new column to the left of point                 |
    |              |                                                        |
    | M-UP/DOWN    | move the current row up/down                           |
    | M-S-UP       | kill the current row or horizontal line                |
    | M-S-DOWN     | insert new row above the current row                   |
    | C-c -        | insert horizontal line below (C-u : above) current row |
    | C-c RET      | insert horizontal line and move to the line below it   |
    | C-c ^        | sort lines region                                      |

*** Regions

    | key                 | good for                             |
    |---------------------+--------------------------------------|
    | C-c C-x C-w/M-w/C-y | cut/copy/paste rectangular region    |
    | C-c C-q             | fill paragraph across selected cells |

*** Miscellaneous

    | key                  | good for                                    |
    |----------------------+---------------------------------------------|
    | ...\vert <N> \vert...        | to limit column width to N characters wide  |
    | C-c `                | edit the current field in a separate window |
    | C-u TAB              | make the current field fully visible        |
    | M-x org-table-export | export as tab-separated file                |
    | M-x org-table-import | import tab-separated file                   |
    | C-c +                | sum numbers in current column/rectangle     |

*** Tables created with the table.el package

    | key     | good for                             |
    |---------+--------------------------------------|
    | C-c ~   | insert a new table.el table          |
    | C-c C-c | recognize existing table.el table    |
    | C-c ~   | convert table (Org-mod <-> table.el) |

*** Spreadsheet

    - Formulas type in field are executed by TAB, RET and C-c C-c.
    - = introduces a column formula.
    - := a field formula

    - jwm: this looks quite powerful, but I'll have to go through the tutorial to make sense of it.
    - in particular, I don't quite understand how expressions are evaluated, and how to correct errors.

    | key                    | good for                             |       a |  b |      sum |
    |------------------------+--------------------------------------+---------+----+----------|
    | #+TBLFM: =$3+$4        | Eg: add col3 and col4                |      42 | 33 |       75 |
    | #+TBLFM: $5=$3+$4;%.2f | ... with printf format spec          | 3.14159 | 42 | 45.14159 |
    |                        | ... with constants from constants.el |         |    |          |
    | :=vsum(@II.@III)       | sum from second to third horiz line  |         |    |          |
    | XXX                    | jwm: more work needed here           |         |    |          |
    #+TBLFM: $5=$3+$4::@5$1=vsum(@II.@III)

*** Formula Editor

    - fill this out from formula editor section

** Links

   | key                 | usage                                           |
   |---------------------+-------------------------------------------------|
   | C-c l               | globally store link to the current location [1] |
   | C-c C-l             | insert a link (TAB completes stored links)      |
   | C-u C-c C-l         | insert a file link with file name completion    |
   | C-c C-l             | edit (also hidden part of) link at point        |
   |                     |                                                 |
   | C-c C-o/mouse-1/2   | open file links in emacs                        |
   | C-u C-c C-o/mouse-3 | ...force open in emacs/other window             |
   | C-c %               | record a position in the mark ring              |
   | C-c &               | jump back to last followed link(s)              |
   | C-c C-x C-n/C-p     | find next/previous link                         |
   | C-c '               | edit code snippet of file at point              |
   | C-c C-x C-v         | toggle inline display of linked images          |

