emacs-cheat-sheet.md


<a id="orgc84986f"></a>

### Row and Column Editing

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">good for</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">M-LEFT/RIGHT</td>
<td class="org-left">move the column left/right</td>
</tr>


<tr>
<td class="org-left">M-S-LEFT</td>
<td class="org-left">kill the current column</td>
</tr>


<tr>
<td class="org-left">M-S-RIGHT</td>
<td class="org-left">insert new column to the left of point</td>
</tr>


<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">M-UP/DOWN</td>
<td class="org-left">move the current row up/down</td>
</tr>


<tr>
<td class="org-left">M-S-UP</td>
<td class="org-left">kill the current row or horizontal line</td>
</tr>


<tr>
<td class="org-left">M-S-DOWN</td>
<td class="org-left">insert new row above the current row</td>
</tr>


<tr>
<td class="org-left">C-c -</td>
<td class="org-left">insert horizontal line below (C-u : above) current row</td>
</tr>


<tr>
<td class="org-left">C-c RET</td>
<td class="org-left">insert horizontal line and move to the line below it</td>
</tr>


<tr>
<td class="org-left">C-c ^</td>
<td class="org-left">sort lines region</td>
</tr>
</tbody>
</table>


<a id="org9c5ff36"></a>

### Regions

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">good for</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">C-c C-x C-w/M-w/C-y</td>
<td class="org-left">cut/copy/paste rectangular region</td>
</tr>


<tr>
<td class="org-left">C-c C-q</td>
<td class="org-left">fill paragraph across selected cells</td>
</tr>
</tbody>
</table>


<a id="orge347d76"></a>

### Miscellaneous

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">good for</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">&#x2026;&vert; <N> &vert;&#x2026;</td>
<td class="org-left">to limit column width to N characters wide</td>
</tr>


<tr>
<td class="org-left">C-c \`</td>
<td class="org-left">edit the current field in a separate window</td>
</tr>


<tr>
<td class="org-left">C-u TAB</td>
<td class="org-left">make the current field fully visible</td>
</tr>


<tr>
<td class="org-left">M-x org-table-export</td>
<td class="org-left">export as tab-separated file</td>
</tr>


<tr>
<td class="org-left">M-x org-table-import</td>
<td class="org-left">import tab-separated file</td>
</tr>


<tr>
<td class="org-left">C-c +</td>
<td class="org-left">sum numbers in current column/rectangle</td>
</tr>
</tbody>
</table>


<a id="org78c6f23"></a>

### Tables created with the table.el package

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">good for</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">C-c ~</td>
<td class="org-left">insert a new table.el table</td>
</tr>


<tr>
<td class="org-left">C-c C-c</td>
<td class="org-left">recognize existing table.el table</td>
</tr>


<tr>
<td class="org-left">C-c ~</td>
<td class="org-left">convert table (Org-mod <-> table.el)</td>
</tr>
</tbody>
</table>


<a id="orge524d56"></a>

### Spreadsheet

-   Formulas type in field are executed by TAB, RET and C-c C-c.
-   = introduces a column formula.
-   := a field formula

-   jwm: this looks quite powerful, but I'll have to go through the tutorial to make sense of it.
-   in particular, I don't quite understand how expressions are evaluated, and how to correct errors.

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">good for</th>
<th scope="col" class="org-right">a</th>
<th scope="col" class="org-right">b</th>
<th scope="col" class="org-right">sum</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">#+TBLFM: =$3+$4</td>
<td class="org-left">Eg: add col3 and col4</td>
<td class="org-right">42</td>
<td class="org-right">33</td>
<td class="org-right">75</td>
</tr>


<tr>
<td class="org-left">#+TBLFM: $5=$3+$4;%.2f</td>
<td class="org-left">&#x2026; with printf format spec</td>
<td class="org-right">3.14159</td>
<td class="org-right">42</td>
<td class="org-right">45.14159</td>
</tr>


<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#x2026; with constants from constants.el</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>


<tr>
<td class="org-left">:=vsum(@II.@III)</td>
<td class="org-left">sum from second to third horiz line</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>


<tr>
<td class="org-left">XXX</td>
<td class="org-left">jwm: more work needed here</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>


<a id="org54bab72"></a>

### Formula Editor

-   fill this out from formula editor section
